#Выведите минимальное из двух введенных чисел.

a, b = int(input()), int(input())
print(min(a, b))