#Выведите максимальное из двух введенных чисел.

a, b = int(input()), int(input())
print(max(a, b))