#Выведите на экран число, равное 18!, которое читается как “факториал числа восемнадцать”. Подробнее о факториале тут:
#http://math-prosto.ru/?page=pages/factorial/factorial.php

print(1*2*3*4*5*6*7*8*9*10*11*12*13*14*15*16*17*18)