#Выведите длину введенной произвольной строки.

a = input()
print(len(a))