#Один популярный в узких кругах заклинатель змей был поражен вашими успехами в изучении языка Python. Именно поэтому он
#дал вам задание, которое позволило бы ему автоматизировать процесс гадания по имени и году рождения, чем он часто
#подрабатывает в свободное от работы время. В этом нам поможет эффект Барнума.
#Программа принимает на вход две строки: имя и год рождения. Исходя из этих данных, на экран выводится описание
#личности пользователя.

name = input()
year = input()
print('Имя', name, 'весьма точно подчеркивает тот факт, что вы очень нуждаетесь в том, чтобы другие люди любили и '
    'восхищались вами. Также', name, 'показывает, что вы довольно самокритичны. Дисциплинированный и '
    'уверенный с виду, на самом деле вы склонны волноваться и чувствовать неуверенность. Также вы гордитесь тем, что '
    'мыслите независимо — мне кажется, сам звук вашего имени говорит о непоколебимой внутренней гордости. Вы родились '
    'в', year, 'году — это говорит мне о том, что вы не принимаете чужих утверждений на веру без достаточных '
    'доказательств. Да, человек, который родился в', year, 'году, заключает в себе положительную энергетику.')