#Напишите программу, вычисляющую площадь произвольного прямоугольника из двух введенных чисел — длин его сторон.
#Формат ввода: два числа (возможно, дробных) на отдельных строках.
#Формат вывода: число (возможно, дробное) — площадь прямоугольника.

a, b = float(input()), float(input())
print(a * b)