#Напишите команду, которая переводит строку "318960012" в целое число и выводит его. Введённая команда не должна
#содержать пробелы. Используйте двойные кавычки. Ответ должен содержать одну строку с нужной командой.

print(int("318960012"))