#Напишите программу, переводящую введенное количество сантиметров в метры.
#Формат ввода: число (возможно, дробное).
#Формат вывода: число (возможно, дробное) — результат перевода.

a = float(input())
print(a / 100)