#Напишите программу, которая принимает на вход два числа и выводит их сумму.

a, b = int(input()), int(input())
print(a + b)