#Операторы сравнения часто применяются в связке с условными конструкциями, однако уже сейчас вы можете практиковаться в
#их использовании. На вход программе подаются две строки. Выведите True, если они НЕ равны и False в обратном случае.

print(input() != input())
